{
  "documents": [
    {
      "doc_id": "doc_1_205",
      "title": "Искусственный интеллект и машинное обучение",
      "content": "\n            Искусственный интеллект (ИИ) — это область компьютерных наук, которая занимается созданием \n            интеллектуальных машин, способных выполнять задачи, обычно требующие человеческого интеллекта. \n            Машинное обучение является подразделом ИИ, которое фокусируется на разработке алгоритмов, \n            способных учиться и принимать решения на основе данных.\n            \n            Основные типы машинного обучения включают обучение с учителем, обучение без учителя \n            и обучение с подкреплением. Нейронные сети являются одним из самых популярных подходов \n            в современном машинном обучении.\n            ",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:37:00.746286",
      "processed_content": "искусственн интеллект это область компьютерн наук котор занима созданием интеллектуальн машин способн выполнять задач обычн требую человеческ интеллект машинн обучен явля подразделом котор фокусиру разработк алгоритм способн учитьс приним решени основ данн основн тип машинн обучени включа обучен учителем обучен учител обучен подкреплением нейронн сет явля одн сам популярн подход современном машинном обучени"
    },
    {
      "doc_id": "doc_2_8347",
      "title": "Python программирование",
      "content": "\n            Python — это высокоуровневый язык программирования общего назначения. Он был создан \n            Гвидо ван Россумом и впервые выпущен в 1991 году. Python известен своим простым и \n            читаемым синтаксисом, что делает его отличным выбором для начинающих программистов.\n            \n            Python широко используется в веб-разработке, анализе данных, искусственном интеллекте, \n            научных вычислениях и автоматизации. Популярные фреймворки включают Django, Flask, \n            NumPy, Pandas и TensorFlow.\n            ",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:37:00.755399",
      "processed_content": "это высокоуровнев язык программировани общ назначени создан гвид ван россумом вперв выпущен год известен сво прост читаем синтаксисом дела отличн выбором начинающ программист широк использу веб разработк анализ данн искусственном интеллект научн вычислени автоматизаци популярн фреймворк включа"
    },
    {
      "doc_id": "doc_3_1371",
      "title": "Базы данных SQL и NoSQL",
      "content": "\n            База данных — это организованная коллекция данных, которая хранится и доступна \n            электронным способом. Существуют два основных типа баз данных: реляционные (SQL) \n            и нереляционные (NoSQL).\n            \n            SQL базы данных используют структурированный язык запросов и следуют реляционной \n            модели данных. Примеры включают MySQL, PostgreSQL и SQLite. NoSQL базы данных \n            предлагают более гибкую схему и включают документные (MongoDB), ключ-значение \n            (Redis), колоночные (Cassandra) и графовые (Neo4j) базы данных.\n            ",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:37:00.759408",
      "processed_content": "баз данн это организованн коллекци данн котор хранитс доступн электронн способом существу основн тип баз данн реляционн нереляционн баз данн использу структурированн язык запрос следу реляционн мод данн пример включа баз данн предлага гибк схем включа документн ключ значен колоночн графов баз данн"
    },
    {
      "doc_id": "doc_4_2335",
      "title": "Алгоритмы сортировки",
      "content": "\n            Алгоритм сортировки — это алгоритм, который упорядочивает элементы списка в \n            определенном порядке. Наиболее распространенными являются сортировка по возрастанию \n            или убыванию числовых значений или лексикографическом порядке строк.\n            \n            Популярные алгоритмы сортировки включают пузырьковую сортировку, быструю сортировку, \n            сортировку слиянием и пирамидальную сортировку. Каждый алгоритм имеет свои \n            преимущества и недостатки в зависимости от размера данных и требований к производительности.\n            ",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:37:00.765400",
      "processed_content": "алгоритм сортировк это алгоритм котор упорядочива элемент списк определенном порядк наибол распространенным явля сортировк возрастани убывани числов значен лексикографическом порядк строк популярн алгоритм сортировк включа пузырьков сортировк быстр сортировк сортировк слиянием пирамидальн сортировк кажд алгоритм име сво преимуществ недостатк зависимост размер данн требован производительност"
    },
    {
      "doc_id": "doc_5_4448",
      "title": "Веб-разработка с React",
      "content": "\n            React — это JavaScript библиотека для создания пользовательских интерфейсов, \n            разработанная Facebook. React позволяет создавать интерактивные веб-приложения \n            с использованием компонентной архитектуры.\n            \n            Основные концепции React включают компоненты, состояние (state), свойства (props) \n            и виртуальный DOM. React часто используется вместе с другими библиотеками и \n            инструментами, такими как Redux для управления состоянием и Webpack для сборки.\n            ",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:37:00.769454",
      "processed_content": "это библиотек создани пользовательск интерфейс разработанн позволя создав интерактивн веб приложени использованием компонентн архитектур основн концепци включа компонент состоян свойств виртуальн част использу вмест другим библиотек инструмент таким управлени состоянием сборк"
    },
    {
      "doc_id": "doc_6_9228",
      "title": "Анализ данных и статистика",
      "content": "\n            Анализ данных — это процесс исследования, очистки, преобразования и моделирования \n            данных с целью обнаружения полезной информации, заключений и поддержки принятия решений.\n            \n            Статистика играет ключевую роль в анализе данных, предоставляя методы для сбора, \n            анализа, интерпретации и представления данных. Популярные инструменты для анализа \n            данных включают Python с библиотеками Pandas и NumPy, R, SQL и специализированные \n            платформы как Tableau и Power BI.\n            ",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:37:00.773419",
      "processed_content": "анализ данн это процесс исследовани очистк преобразовани моделировани данн цель обнаружени полезн информаци заключен поддержк приняти решен статистик игра ключев роль анализ данн предоставл метод сбор анализ интерпретаци представлени данн популярн инструмент анализ данн включа библиотек специализированн платформ"
    },
    {
      "doc_id": "doc_7_8863",
      "title": "Машинное обучение",
      "content": "Машинное обучение - это метод анализа данных, который автоматизирует построение аналитических моделей.",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:38:39.512932",
      "processed_content": "машинн обучен это метод анализ данн котор автоматизиру построен аналитическ модел"
    },
    {
      "doc_id": "doc_8_3701",
      "title": "Искусственный интеллект",
      "content": "Искусственный интеллект - это имитация человеческого интеллекта в машинах.",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:38:39.514930",
      "processed_content": "искусственн интеллект это имитаци человеческ интеллект машин"
    },
    {
      "doc_id": "doc_9_7053",
      "title": "Python программирование",
      "content": "Python - популярный язык программирования для веб-разработки и анализа данных.",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:38:39.560171",
      "processed_content": "популярн язык программировани веб разработк анализ данн"
    },
    {
      "doc_id": "doc_10_8071",
      "title": "Базы данных",
      "content": "Базы данных используются для хранения и управления структурированными данными.",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:38:39.562182",
      "processed_content": "баз данн использу хранени управлени структурированным данным"
    },
    {
      "doc_id": "doc_11_8419",
      "title": "Веб-разработка",
      "content": "Веб-разработка включает создание веб-сайтов и веб-приложений.",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:38:39.564177",
      "processed_content": "веб разработк включа создан веб сайт веб приложен"
    },
    {
      "doc_id": "doc_12_1697",
      "title": "Анализ данных",
      "content": "Анализ данных помогает извлекать полезную информацию из больших объемов данных.",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:38:39.565173",
      "processed_content": "анализ данн помога извлек полезн информаци больш объем данн"
    },
    {
      "doc_id": "doc_13_8682",
      "title": "Тест документ",
      "content": "Это тестовый документ для демонстрации управления.",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:38:39.604804",
      "processed_content": "это тестов документ демонстраци управлени"
    },
    {
      "doc_id": "doc_14_7210",
      "title": "Программирование на Python",
      "content": "Python - отличный язык для начинающих программистов.",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:38:39.645846",
      "processed_content": "отличн язык начинающ программист"
    },
    {
      "doc_id": "doc_15_1996",
      "title": "Изучение Python",
      "content": "Python можно изучать самостоятельно или на курсах.",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:38:39.647245",
      "processed_content": "изуч самостоятельн курс"
    },
    {
      "doc_id": "doc_16_1786",
      "title": "Python в веб-разработке",
      "content": "Django и Flask - популярные фреймворки Python для веб-разработки.",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:38:39.649774",
      "processed_content": "популярн фреймворк веб разработк"
    },
    {
      "doc_id": "doc_17_9308",
      "title": "Программирование на Python",
      "content": "Привет я умею программировать на Python это круто я могу тыкать кнопки на клавиатуре и пить лавандовый раф на альтернативном молоке",
      "file_path": null,
      "metadata": {},
      "created_at": "2025-09-20T14:47:29.444859",
      "processed_content": "прив ум программиров это крут мог тык кнопк клавиатур пить лавандов раф альтернативном молок"
    }
  ],
  "last_updated": "2025-09-20T14:47:29.446366"
}